#+PROPERTY: header-args:R  :session *R:cretaceous-constraints* :exports results :results output :eval no-export
#+options: TOC:nil
* COMMENT libs
#+begin_src R :exports code
  library(tidyverse)
  library(patchwork)
  theme_set(theme_bw())
#+end_src

#+RESULTS:
#+begin_example
── Attaching core tidyverse packages ───────────────────────────────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.2     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.3     ✔ tibble    3.2.1
✔ lubridate 1.9.2     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ─────────────────────────────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors
#+end_example

* COMMENT reproduce [cite:@Ma2017] steps
:PROPERTIES:
:CREATED:  [2023-08-28 Mon 10:52]
:END:
Load the R package Astrochron
This analysis uses version 0.6.6. Please use versions >= 0.6.6.

#+begin_src R
  library(astrochron)
#+end_src

#+RESULTS:
: Welcome to astrochron v1.2 (2023-08-25)
:  Type ?astrochron to learn more

* COMMENT read [cite:@ZeebeLourens2019,@ZeebeLourens2022] to reproduce their approach
:PROPERTIES:
:CREATED:  [2023-08-28 Mon 11:56]
:END:
:LOGBOOK:
CLOCK: [2023-08-28 Mon 17:02]--[2023-08-28 Mon 17:10] =>  0:08
CLOCK: [2023-08-28 Mon 14:55]--[2023-08-28 Mon 17:02] =>  2:07
- try to reproduce, cannot figureit out?
CLOCK: [2023-08-28 Mon 14:10]--[2023-08-28 Mon 14:55] =>  0:45
- do 2.4 Myr analysis on ZB18a
CLOCK: [2023-08-28 Mon 11:20]--[2023-08-28 Mon 12:08] =>  0:48
:END:

Richard's code
#+begin_src matlab
f  = 1./2000;
df = 0.6;

yf{i} = gaussfilter(t{i},y{i},f,df*f,2*df*f,0.0);

[~,ix{i}] = findpeaks(-yf{i});
kv = ix{i};
dt{i} = diff(t{i}(kv));
#+end_src


#+begin_src R
  library(tidyverse)

  # get orbital solution sol
  sol <- snvecR::get_ZB18a() |>
    select(age, ee)

  # Do the same as Zeebe and Lourens 2022:
  # filter 2 Myr ± 60% Gaussian
  # 2 Myr = 2000 kyr period = 1 / 2000 period
  x11(type = "cairo")
  bp2000 <- sol |>
    astrochron::bandpass(
                  padfac = 10, # 10x the number of data points
                  # parameterized as I understand Richard's matlab code
                  # this doesn't make any sense to me
                  ## flow = 0.6 * 1 / 2000,
                  ## fhigh = 2 * 0.6 * 1 / 2000,
                  flow = 1 / 2000 - 0.6 * 1 / 2000,
                  fhigh = 1 / 2000 + 0.6 * 1 / 2000,
                  win = 1, # Gaussian window
                  demean = TRUE, detrend = TRUE, #???
                  addmean = FALSE,
                  xmax = .02)
  grDevices::savePlot("imgs/2023-08-28_0_2Myr_bandpass_filter.png")

  # get the peak maxima
  pk2000 <- bp2000 |>
    astrochron::peak()
  grDevices::savePlot("imgs/2023-08-28_1_peak.png")

  # but in the paper they do peak minima, we just flip the input
  pk2000_flip <- bp2000 |>
    mutate(ee = -ee) |>
    astrochron::peak(genplot = TRUE)
  grDevices::savePlot("imgs/2023-08-28_2_peak.png")

  # calculate deltas between peaks
  pk2000_tidy <- pk2000 |>
    as_tibble() |>
    # different ways to calculate the delta
    mutate(delta_vln_lag = Location - lag(Location)) |> # this one minus previous one
    mutate(delta_vln = lead(Location) - Location) # next one minus this one
  pk2000_flip_tidy <- pk2000_flip |>
    as_tibble() |>
    mutate(delta_vln_lag = Location - lag(Location)) |>
    mutate(delta_vln = lead(Location) - Location)

  # check that peak id has gone well
  bp2000 |>
    ggplot(aes(x = age, y = ee)) +
    geom_line() +
    geom_point(aes(x = Location, y = Peak_Value, colour = "maxima"), data = pk2000_tidy) +
    geom_point(aes(x = Location, y = -Peak_Value, colour = "minima"), data = pk2000_flip_tidy)
  ggsave("~/SurfDrive/Postdoc1/prj/2023-05-19_cretaceous/imgs/2023-08-28_3_check_peaks.png")

  # create a plot similar to Zeebe and Lourens 2022 EPSL figure 6a
  pk2000_tidy |>
    ggplot(aes(x = Location / 1000, y = delta_vln / 1000)) +
    ## geom_point(aes(colour = "maxima lead")) +
    ## geom_line(aes(colour = "maxima lead")) +
    geom_point(aes(colour = "minima lead"), data = pk2000_flip_tidy) +
    geom_line(aes(colour = "minima lead"), data = pk2000_flip_tidy) +
    # did they use the half-distance? nope
    ## geom_point(aes(x = (Location + .5 * (lead(Location) - Location)) / 1000, colour = "minima lead"), data = pk2000_flip_tidy) +
    ## geom_line(aes(x = (Location + .5 * (lead(Location) - Location)) / 1000, colour = "minima lead"), data = pk2000_flip_tidy) +
    ## geom_point(aes(y = delta_vln_lag / 1000, colour = "maxima lag")) +
    ## geom_line(aes(y = delta_vln_lag / 1000, colour = "maxima lag")) +
    ## geom_point(aes(y = delta_vln_lag / 1000, colour = "minima lag"), data = pk2000_flip_tidy) +
    ## geom_line(aes(y = delta_vln_lag / 1000, colour = "minima lag"), data = pk2000_flip_tidy) +
    labs(x = "Age (Ma)",
         y = Delta[VLN] ~ "Interval between min/max in 2-Myr ecc filter (Myr)") +
    scale_x_continuous(breaks = seq(40, 80, 5)) +
    coord_cartesian(xlim = c(44, 70), ylim = c(0, 3))

  ggsave("imgs/2023-08-28_4_Dvln.png", width = 8, height = 3)
  ## ggsave("~/SurfDrive/Postdoc1/prj/2023-05-19_cretaceous/imgs/2023-08-28_4_Dvln.png")
#+end_src

#+RESULTS:
#+begin_example

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 250001
 ,* Sample interval= 0.4
 ,* Mean value removed= 0.02683078
 ,* Center of bandpass filter = 5e-04
 ,* 600 pos/neg frequency pairs will be bandpassed

----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 250001
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 50

 ,* No filtering of peaks applied.

----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 250001
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 51

 ,* No filtering of peaks applied.
Saving 7 x 6.99 in image
Warning messages:
1: Removed 1 rows containing missing values (`geom_point()`).
2: Removed 1 row containing missing values (`geom_line()`).
Warning messages:
1: Removed 1 rows containing missing values (`geom_point()`).
2: Removed 1 row containing missing values (`geom_line()`).
#+end_example

***** plots to try to understand the splice table
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 17:15]
:END:
#+begin_src R
  rmcd |>
    ggplot(aes(x = depth_mbsf, y = depth_rmcd, colour = H)) +
    geom_point(alpha = .5) +
    geom_segment(aes(xend = depth_mbsf, yend = depth_rmcd2),
                 arrow = arrow(angle = 20, length = unit(2, "mm"), type = "closed")) +
    geom_line(aes(y = depth_rmcd), linetype = "dashed") +
    ## geom_line(aes(x = depth_mbsf2, y = depth_rmcd2))
    geom_line(aes(y = depth_rmcd2))
    ## geom_line(linetype = "dashed") #+
    ## geom_line(aes(x = depth_mbsf2))

  rmcd |>
    ggplot(aes(x = depth_rmcd, y = row)) +
    geom_point(alpha = .2) +
    geom_point(aes(x = depth_rmcd2), color = "red", alpha = .2) +
    geom_segment(aes(xend = depth_rmcd2, yend = row),
                 arrow = arrow(angle = 20, length = unit(2, "mm"), type = "closed"))

  # i'm confused by how to work with this splice table
  rmcd |>
    ggplot(aes(x = 1, y = depth_rmcd, colour = H)) +
    geom_point() +
    geom_point(aes(x = 2, y = depth_rmcd2)) +
    geom_segment(aes(xend = 2, yend = depth_rmcd2), colour = "black") +
    ## facet_grid(cols = vars(hole)) +
    scale_y_reverse() +
    coord_cartesian(xlim = c(-4, 6))
#+end_src

#+RESULTS:
: Warning messages:
: 1: Removed 1 rows containing missing values (`geom_segment()`).
: 2: Removed 1 row containing missing values (`geom_line()`).
: + Warning messages:
: 1: Removed 1 rows containing missing values (`geom_point()`).
: 2: Removed 1 rows containing missing values (`geom_segment()`).
: + Warning messages:
: 1: Removed 1 rows containing missing values (`geom_point()`).
: 2: Removed 1 rows containing missing values (`geom_segment()`).

understand the splice table
#+begin_src R
  ODP208_1267_MS_A |>
    mutate(Sec = as.character(Sec)) |>
    ggplot(aes(x = `Depth (mbsf)`,
               y = `Corrected Suscept.`,
               colour = H, group = H,
               Site = Site, Core = Core, T = T, Sec = Sec)) +
    geom_line() +
    geom_line(aes(y = `Corrected Suscept.` + 100), data = ODP208_1267_MS_B) +
    # this shows how the holes line up from XRF data and MS data
    geom_segment(aes(x = depth_mbsf, xend = depth_mbsf2, y = -200, yend = -10,
                     lab2 = label2),
                 data = rmcd |> filter(H == "A")) +
    geom_segment(aes(x = depth_mbsf, xend = depth_mbsf2, y = -10, yend = -200,
                     lab2 = label2),
                 data = rmcd |> filter(H == "B")) #+
    # this shows the stretching they applied after
    ## geom_segment(aes(xend = depth_rmcd2, y = 0, yend = 500), data = rmcd)
#+end_src

**** create a shiny interface
:PROPERTIES:
:CREATED:  [2023-09-22 Fri 08:42]
:END:
:LOGBOOK:
CLOCK: [2023-09-22 Fri 08:42]--[2023-09-22 Fri 09:30] =>  0:48
:END:
this is to inspect how the moving average affects the outcome
#+begin_src R
  library(shiny)
  library(bslib)
  library(plotly)

  cleandat <- MS |>
    tidylog::filter(
               !is.na(my_rmcd),
               ## my_rmcd > 319.46,
               my_rmcd > 320.25, # K/Pg boundary
               on_splice) |>
    mutate(var = scale(`Corrected Suscept.`)[, 1]) |>
    select(my_rmcd, var)

  rawmtm <- cleandat |>
    astrochron::linterp(genplot = FALSE, verbose = FALSE) |>
    astrochron::mtm(detrend = TRUE, demean = TRUE, xmax = 5,
                    output = 1,
                    verbose = FALSE,
                    genplot = FALSE) |>
    as_tibble()

  rawfreq <- cleandat |>
    astrochron::linterp(genplot = FALSE, verbose = FALSE) |>
    astrochron::mtm(detrend = TRUE, demean = TRUE, xmax = 5,
                    output = 3,
                    verbose = FALSE,
                    genplot = FALSE) |>
    as_tibble()


  ui <- page_sidebar(
    theme = bs_theme(bootswatch = "minty"),
    sidebar = sidebar(
      sliderInput(inputId = "width",
                  label = "Width of the moving average",
                  min = 1,
                  max = 200,
                  value = 200)
    ),
    plotOutput("raw"),
    plotOutput("mtm"),
    plotOutput("wavelet")
  )

  server <- function(input, output, session) {
    filt <- reactive(MS |>
      tidylog::filter(
                 !is.na(my_rmcd),
                 my_rmcd > 320.25, # K/Pg
                 on_splice) |>
      mutate(var = scale(`Corrected Suscept.`)[, 1]) |> # or `L*`
      mutate(scl_ma = scale(var - slider::slide_mean(var,
                                                     before = input$width,
                                                     after = input$width))[, 1]))
    freqs <- reactive(filt() |>
                      select(my_rmcd, scl_ma) |>
                      astrochron::linterp(genplot = FALSE, verbose = FALSE) |>
                      astrochron::mtm(detrend = TRUE, demean = TRUE, xmax = 5,
                                      output = 3,
                                      verbose = FALSE,
                                      genplot = FALSE) |>
                      as_tibble())

    output$raw <- renderPlot({
      ## pl_raw <-
        filt() |>
        ggplot(aes(x = my_rmcd, y = var)) +
        geom_line(aes(colour = "scale(MS)")) +
        geom_line(aes(y = scl_ma, colour = glue::glue("moving average")))
      ## plotly::toWebGL(plotly::ggplotly(p = pl_raw, dynamicTicks = TRUE))
    })

    output$mtm <- renderPlot({
      ## plmtm <-
        filt() |>
        select(my_rmcd,
           ## var
           scl_ma
           ## scl_gam
           ## scl_loess
           ) |>
        astrochron::linterp(genplot = FALSE, verbose = FALSE) |>
        astrochron::mtm(detrend = TRUE, demean = TRUE, xmax = 5, verbose = FALSE, output = 1,
                        genplot = FALSE) |>
        ggplot(aes(x = Frequency, y = Power)) +
        geom_segment(aes(xend = Frequency, y = 0, yend = Harmonic_CL),
                     colour = "lightgray",
                     data = rawfreq) +
        geom_line(data = rawmtm, colour = "darkgray") +
        geom_segment(aes(xend = Frequency, y = 0, yend = Harmonic_CL),
                     colour = "darkgray", linetype = "dotted",
                     data = freqs()) +
        geom_line() +
        scale_y_log10() +
        ## scale_x_continuous(
        ##   sec.axis = sec_axis(trans = ~ 1 / .x,
        ##                       name = "Period",
        ##                       breaks = c(.01, .5, .1, 1, 10))) +
        geom_line(aes(y = AR1_fit), colour = "red") +
        geom_line(aes(y = AR1_90_power), colour = "red") +
        geom_line(aes(y = AR1_95_power), colour = "red") +
        geom_line(aes(y = AR1_99_power), colour = "red") +
        coord_cartesian(xlim = c(0, 10))
        ## coord_cartesian(xlim = c(0.050, 1 / 10))
      ## plotly::toWebGL(plotly::ggplotly(p = plmtm, dynamicTicks = TRUE))
    })

    output$wavelet <- renderPlot({
      filt() |>
        select(my_rmcd, scl_ma) |>
        WaverideR::analyze_wavelet(lowerPeriod = .3,
                                   upperPeriod = 20,
                                   omega_nr = 8) |>
        WaverideR::plot_wavelet(palette_name = "inferno",
                                siglvl = .95,
                                dev_new = FALSE,
                                add_data = FALSE,
                                add_MTM = FALSE, # NOT WORKING!
                                add_MTM_peaks = FALSE,
                                )
    })
  }

  shinyApp(ui, server)
#+end_src
**** agemodel from Neptune database [cite:@Renaudie2020] (only hole B)
:PROPERTIES:
:CREATED:  [2023-09-20 Wed 09:43]
:END:
#+begin_src R
  agem3 <- readr::read_tsv("dat/Renaudie2020/agem.csv")

  agem3 |>
    ggplot(aes(x = `Depth (mbsf)`, y = `Age (Ma)`)) +
    geom_line() +
    geom_line(aes(x = `Depth (mcd)`), data = agem_sb, colour = "red")
#+end_src

#+RESULTS:
: indexing agem.csv [=================================================================] 59.00MB/s, eta:  0s                                                                                                                                            Rows: 22 Columns: 4
: ── Column specification ─────────────────────────────────────────────────────────────────────────────────
: Delimiter: "\t"
: chr (2): Hole, Comment
: dbl (2): Age (Ma), Depth (mbsf)
:
: ℹ Use `spec()` to retrieve the full column specification for this data.
: ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
: Error: object 'agem_sb' not found

*** plot the age model on top of the depth MS data
:PROPERTIES:
:CREATED:  [2023-09-22 Fri 09:32]
:END:
#+begin_src R
  MS |>
    ggplot(aes(x = my_rmcd, y = `Corrected Suscept.`, colour = H, group = paste(H, Core, T, Sec),
               Sec = Sec)) +
    geom_line(aes(alpha = on_splice)) +
    geom_point(aes(x = depth_rmcd, y = 0, age = age_ma, strat_event = strat_event),
               inherit.aes = FALSE, data = agem2)
#+end_src

#+RESULTS:
: Warning messages:
: 1: In geom_point(aes(x = depth_rmcd, y = 0, age = age_ma, strat_event = strat_event),  :
:   Ignoring unknown aesthetics: age and strat_event
: 2: Using alpha for a discrete variable is not advised.
: 3: Removed 2230 rows containing missing values (`geom_line()`).

*** analyze MS data in the time domain
:PROPERTIES:
:CREATED:  [2023-09-22 Fri 10:00]
:END:
#+begin_src R
  MS_ |>
    mutate(age = approx(agem2$depth_rmcd, agem2$age_ma,
                        xout = my_rmcd)$y) |>
    ## filter(my_rmcd <= 355.350) |> # there's a coregap after this
    ## filter(my_rmcd >= 356.950) |> # there's a coregap before this
    select(age,
           ## var
           scl_gam
           ) |>
    WaverideR::analyze_wavelet(lowerPeriod = .01,
                               upperPeriod = 1.5,
                               omega_nr = 8,
                               ## verbose = TRUE
                               ) |>
    WaverideR::plot_wavelet(palette_name = "inferno",
                            siglvl = .95,
                            dev_new = FALSE,
                            ## add_avg = TRUE,
                            add_MTM = TRUE, # NOT WORKING!
                            add_MTM_peaks = TRUE,
                            add_abline_h = c(0.405, 0.125, 0.027)
                            )
#+end_src

#+RESULTS:
: Warning message:
: In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
:   collapsing to unique 'x' values

**** read in the data and calculate normalized a*/b*
#+begin_src R
  ODP208_1267_color_A <- readr::read_tsv("dat/ODP208_1267_color-reflectance.dat")
  ODP208_1267_color_B <- readr::read_tsv("dat/ODP208_1267_color-reflectance_B.dat")

  # dat is only hole B for now
  dat <- ODP208_1267_color_B |>
    select(depth = `Depth (mbsf)`,
           Lstar = `L*`,
           astar = `a*`,
           bstar = `b*`) |>
    filter(depth >= 285.9) |>
    mutate(aob = scale(astar / bstar)[, 1]) |>
    select(depth, aob, everything())

  # raw data with simple loess curve
  dat |>
    ggplot(aes(x = depth, y = Lstar)) +
    geom_line() +
    geom_line(aes(x = `Depth (mbsf)`, y = `L*`), data = ODP208_1267_color_A, alpha = .2) +
    geom_smooth(method = "loess", span = .2) +
    geom_smooth(method = "gam", color = "orange")
#+end_src

#+RESULTS:
#+begin_example
indexed 0B in  0s, 0B/sindexed 1.00TB in  0s, 38.17TB/s                                                                                                       Rows: 25316 Columns: 15
── Column specification ─────────────────────────────────────────────────────────────────────────────────
Delimiter: "\t"
chr  (4): H, T, Sec, Munsell_HVC
dbl (11): Leg, Site, Core, Top (cm), Depth (mbsf), L*, a*, b*, X, Y, Z

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
indexing ODP208_1267_color-reflectance_B.dat [=====================================] 143.06GB/s, eta:  0s                                                                                                                                            Rows: 13263 Columns: 15
── Column specification ─────────────────────────────────────────────────────────────────────────────────
Delimiter: "\t"
chr  (4): H, T, Sec, Munsell_HVC
dbl (11): Leg, Site, Core, Top (cm), Depth (mbsf), L*, a*, b*, X, Y, Z

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.
`geom_smooth()` using formula = 'y ~ x'
`geom_smooth()` using formula = 'y ~ s(x, bs = "cs")'
#+end_example
***** use taner filters
:PROPERTIES:
:CREATED:  [2023-09-19 Tue 12:16]
:END:
#+begin_src R
  f100 <- dat |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::taner(flow = .07, fhigh = 0.9, xmax = 3) |>
    as_tibble()

  f405 <- dat |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::taner(flow = .07, fhigh = 0.25, xmax = 1) |>
    as_tibble()

  ## f100_2 <- dat |>
  ##   astrochron::linterp(genplot = FALSE) |>
  ##   astrochron::bandpass(flow = .1, fhigh = .5, win = 1, xmax = 5)
#+end_src

#+RESULTS:
#+begin_example
----- TANER BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= 11.30448
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** get the maxima of the 405 kyr filter
:PROPERTIES:
:CREATED:  [2023-09-19 Tue 12:17]
:END:
#+begin_src R
  pk405 <- f405 |>
    astrochron::peak() |>
    as_tibble() |>
    mutate(
      n_cyc = 1:n(),
      age_405 = 65940 + n_cyc * 405) # ZB18a eq 2 or 66.96 for eq 3

  pk405 |>
    ggplot(aes(x = Location, y = age_405)) +
    geom_line() + geom_point()

  dat <- dat |>
    mutate(
      age = astrochron::tune(dat,
                   controlPts = pk405 |>
                     select(depth = Location, age_405),
                   extrapolate = TRUE,
                   genplot = FALSE)$X1)

  dat |>
    ggplot(aes(x = age, y = aob)) +
    geom_line()

  dat |>
    select(age, aob) |>
    mutate(aob = aob - slider::slide_mean(aob, before = 200, after = 200)) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::mtm(xmax = .06)
#+end_src

#+RESULTS:
#+begin_example
----- FINDING MAXIMA OF PEAKS, FILTERING AT THRESHOLD VALUE -----
 ,* Number of data points= 1733
 ,* Number of columns= 2
 ,* Identifying maxima of peaks
 ,* Number of peaks identified= 9

 ,* No filtering of peaks applied.
----- TUNING STRATIGRAPHIC SERIES -----
 ,* Number of data points= 1840
 ,* Number of time control points= 9
 ,* Sorting datasets into ensure increasing order, removing empty entries

,**** WARNING: duplicate depth/height datum found in dat

 ,* Mean sampling interval= 2.096929
 ,* Median sampling interval= 2.154255
 ,* Maximum sampling interval= 7.941176
 ,* Minimum sampling interval= 0

----- PERFORMING Multitaper Spectral Analysis -----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 2.154255
 ,* New number of samples= 1791
 ,* Number of data points in stratigraphic series: 1791
 ,* Stratigraphic series length (space or time): 3856.117
 ,* Sampling interval (space or time): 2.154255
 ,* Will use default setting of 5 DPSS tapers
 ,* Mean value subtracted= 0.00882429
 ,* Linear trend NOT subtracted
 ,* Nyquist frequency: 0.2320988
 ,* Rayleigh frequency: 0.0002591834
 ,* MTM Power spectrum bandwidth resolution (halfwidth): 0.0007775503
 ,* Padded to 8956 points

 ,* Searching for significant spectral peaks that satisfy 90 % CL
     requirements outlined in Meyers (2012):
 ,* Number of significant F-test peaks identified = 33
ID  / Frequency / Period / Harmonic_CL / Rednoise_CL
1   0.002798869   357.2872   90.68548   98.53344
2   0.003835487   260.7231   96.06114   96.35961
3   0.007256326   137.8108   97.68282   82.70286
4   0.02752221   36.33429   97.5   80.64475
5   0.02829967   35.3361   93.87141   79.03028
6   0.02933629   34.08747   99.54662   93.66677
7   0.0411019   24.32977   98.98623   84.84235
8   0.0531785   18.80459   95.4257   74.80281
9   0.05447427   18.35729   99.89771   95.87553
10   0.06287088   15.90561   95.22755   97.11556
11   0.06395933   15.63494   93.02414   89.89813
12   0.06696552   14.93306   91.90037   73.29973
13   0.0681058   14.68304   98.00992   82.16992
14   0.07474016   13.37969   99.96271   91.50175
15   0.07852381   12.73499   97.43281   65.44862
16   0.09231083   10.83296   95.61134   89.70635
17   0.09422857   10.61249   99.31377   99.89063
18   0.1000855   9.991461   93.88109   76.57064
19   0.1010184   9.899185   98.41569   72.34155
20   0.102677   9.739278   90.12556   94.56918
21   0.1049576   9.52766   97.28039   85.37081
22   0.1077564   9.280188   91.26549   72.50968
23   0.1085339   9.213711   97.25827   90.16475
24   0.1096224   9.122227   94.33675   77.94989
25   0.112784   8.866503   96.57953   69.30783
26   0.1211806   8.252143   96.03697   56.31232
27   0.1220099   8.196054   98.88495   84.78227
28   0.1249643   8.002286   99.84032   79.34508
29   0.1367817   7.310917   91.50361   88.80223
30   0.1441936   6.935122   90.96567   94.40426
31   0.1635265   6.115217   95.39002   85.09184
32   0.167051   5.986196   95.01506   91.9216
33   0.1933293   5.172523   94.30443   84.0192
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** remove long-term trends in the depth domain
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:39]
:END:
#+begin_src R
  fit_loess <- loess(aob ~ depth, data = dat, span = .75)
  fit_gam <- mgcv::gam(aob ~ s(depth, bs = "cs"), data = dat)

  lp <- dat |>
    select(depth, aob## Lstar_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::lowpass(fcut = 1 / 15) # how do you decide which frequency to cull?
  # this is linearly interpolated so it can't go into the other df

  # let's see how sensitive it is to the span or to size of the rolling mean
  dat <- dat |>
    mutate(
      # there are several methods of calculating a rolling average
      ## ma = roll::roll_mean() # that's left-aligned
      ## ma = zoo::rollmean(Lstar, k = 33, align = "center", na.pad = TRUE),
      # I prefer the slider implementation, it's FAAAST
      # I've played around with the size of the window. If I make it larger,
      # more low-frequency peaks are preserved.
      ma = slider::slide_mean(aob, before = 200, after = 200),
      loess = predict(fit_loess),
      gam = predict(fit_gam),
      scl = scale(Lstar)[, 1],
      loess_scl = scale(aob - loess)[, 1],
      gam_scl = scale(aob - loess)[, 1],
      ma_scl = scale(aob - ma)[, 1])

  dat |>
    ggplot(aes(x = depth, y = aob)) +
    geom_line(alpha = .3) +
    geom_line(aes(y = loess), colour = "orange") +
    geom_line(aes(y = gam), colour = "red") +
    geom_line(aes(y = ma), colour = "indianred")

  dat |>
    ggplot(aes(x = depth, y = aob)) +
    geom_line() +
    geom_line(aes(y = loess_scl + 3), colour = "orange") +
    geom_line(aes(y = gam_scl + 6), colour = "red") +
    geom_line(aes(y = ma_scl + 9), colour = "indianred")
#+end_src

#+RESULTS:
#+begin_example
----- LOWPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= 0.01953956
 ,* 5 pos/neg frequency pairs and f(0) will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** do mtm analysis  in the depth domain
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:55]
:END:
#+begin_src R
  dat |>
    drop_na() |>
    select(depth,
           ## aob
           ## Lstar,
           ## loess_scl
           ## gam_scl
           ma_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    astrochron::mtm(output = 1, xmax = 10) |>
    as_tibble()
#+end_src

#+RESULTS:
#+begin_example
----- PERFORMING Multitaper Spectral Analysis -----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points in stratigraphic series: 1733
 ,* Stratigraphic series length (space or time): 43.3
 ,* Sampling interval (space or time): 0.025
 ,* Will use default setting of 5 DPSS tapers
 ,* Mean value subtracted= -0.007338007
 ,* Linear trend NOT subtracted
 ,* Nyquist frequency: 20
 ,* Rayleigh frequency: 0.02308136
 ,* MTM Power spectrum bandwidth resolution (halfwidth): 0.06924409
 ,* Padded to 8666 points

 ,* Searching for significant spectral peaks that satisfy 90 % CL
     requirements outlined in Meyers (2012):
 ,* Number of significant F-test peaks identified = 46
ID  / Frequency / Period / Harmonic_CL / Rednoise_CL
1   0.1477037   6.770312   97.81888   70.95153
2   0.3507962   2.850658   96.15821   99.83479
3   0.549273   1.820588   99.93298   95.71491
4   0.6600508   1.515035   91.60759   59.35608
5   2.506347   0.3989871   99.90005   97.14331
6   2.594046   0.3854982   92.58703   84.48891
7   4.264943   0.2344697   92.27711   88.87931
8   5.67736   0.1761382   96.11432   89.04281
9   6.106624   0.1637566   99.97548   64.3143
10   7.957535   0.1256671   98.05545   84.35803
11   8.156012   0.1226089   99.56947   93.36902
12   8.636049   0.1157937   93.82859   89.15123
13   9.162243   0.1091436   94.41139   94.81218
14   9.254558   0.1080549   97.05078   90.86573
15   9.780752   0.1022416   99.25119   89.55859
16   10.58389   0.09448321   97.63315   95.10522
17   11.0547   0.09045929   95.32547   71.18952
18   11.17009   0.08952479   93.37106   94.26625
19   11.23933   0.08897331   94.40806   69.16598
20   11.34549   0.08814076   97.58416   82.10638
21   11.65474   0.08580198   96.48069   92.10786
22   12.3748   0.0808094   95.1167   97.58248
23   12.6379   0.0791271   93.62709   93.73139
24   12.91946   0.07740264   93.56098   98.65819
25   13.021   0.07679901   99.36458   62.45722
26   13.99954   0.07143093   93.03784   69.10545
27   14.09647   0.07093975   99.06973   99.20623
28   14.3688   0.06959525   98.68524   64.65251
29   14.43803   0.06926151   98.14767   87.79034
30   14.62266   0.06838699   93.01484   71.31289
31   14.81652   0.06749221   93.2065   96.91767
32   14.92269   0.06701206   98.81679   88.57128
33   15.26425   0.06551255   90.33441   64.59363
34   15.31964   0.06527569   90.22784   91.29449
35   15.62428   0.06400295   97.42037   85.11671
36   16.00277   0.06248918   97.92532   68.65022
37   17.09208   0.05850662   94.69208   88.55884
38   17.56751   0.05692328   94.97037   98.45663
39   17.70598   0.0564781   95.89307   66.52896
40   17.7706   0.05627273   94.15521   82.41941
41   17.80291   0.0561706   94.19327   72.928
42   17.91369   0.05582324   99.42919   89.47333
43   18.30141   0.05464061   90.11566   73.50925
44   18.47681   0.05412191   99.35983   57.57737
45   18.5645   0.05386624   99.42766   59.69106
46   19.87076   0.0503252   99.85037   87.35517
# A tibble: 4,332 × 8
   Frequency   Power Harmonic_CL AR1_CL AR1_fit AR1_90_power AR1_95_power AR1_99_power
       <dbl>   <dbl>       <dbl>  <dbl>   <dbl>        <dbl>        <dbl>        <dbl>
 1   0.00462 0.00286        13.7   56.8 0.00283      0.00452      0.00518      0.00656
 2   0.00923 0.00276        10.4   53.9 0.00283      0.00452      0.00518      0.00656
 3   0.0138  0.00263        11.0   49.5 0.00283      0.00452      0.00518      0.00656
 4   0.0185  0.00248        25.8   44.7 0.00283      0.00452      0.00518      0.00656
 5   0.0231  0.00232        57.8   39.0 0.00283      0.00452      0.00518      0.00656
 6   0.0277  0.00214        87.9   33.0 0.00283      0.00452      0.00518      0.00656
 7   0.0323  0.00201        98.8   28.5 0.00283      0.00452      0.00518      0.00656
 8   0.0369  0.00193       100.    25.8 0.00283      0.00452      0.00518      0.00656
 9   0.0415  0.00186       100.    23.4 0.00283      0.00452      0.00518      0.00656
10   0.0462  0.00175        99.1   20.0 0.00283      0.00452      0.00518      0.00656
# ℹ 4,322 more rows
# ℹ Use `print(n = ...)` to see more rows
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
#+end_example

***** bandpass filtering in the depth domain
:PROPERTIES:
:CREATED:  [2023-09-21 Thu 11:56]
:END:
#+begin_src R
  # I like gam I think?
  filt_bp_2.4 <- dat |>
    drop_na() |>
    select(depth, gam_scl) |>
    astrochron::linterp(genplot = FALSE) |>
    # this is peak no 1
    astrochron::bandpass(flow = 0.042 - .15 * .042, fhigh = 0.042 + .15 * .042, win = 1, xmax = 1) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp_405 <- dat |>
    drop_na() |>
    select(depth,
           ## gam_scl
           ma_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    # this is peak no 2, no 3 = 0.5 (based on gam_scl)
    ## astrochron::bandpass(flow = 0.35 - .15 * .35, fhigh = 0.35 + .15 * .35, win = 1, xmax = 1) |> # gaussian window
    # this is based on the ma_scl, peak number 1 appears: 0.1477
    astrochron::bandpass(flow = 0.148 - .15 * .148, fhigh = 0.148 + .15 * .148, win = 1, xmax = 1) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp_100 <- dat |>
    drop_na() |>
    select(depth,
           ## gam_scl
           ma_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    # this is peak no. 5/6
    ## astrochron::bandpass(flow = 2.51 - .15 * 2.51, fhigh = 2.51 + .15 * 2.51, win = 1, xmax = 10) |> # gaussian window
    # this is ma_scl peak no. 3
    astrochron::bandpass(flow = 0.55 - .15 * .55, fhigh = .55 + .15 * .55, win = 1, xmax = 10) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_bp_prec <- dat |>
    drop_na() |>
    select(depth,
           ## gam_scl
           ma_scl
           ) |>
    astrochron::linterp(genplot = FALSE) |>
    ## astrochron::bandpass(flow = 0, fhigh = .3, win = 0, xmax = 1) |> # uniform window
    # this is peak no. 9
    ## astrochron::bandpass(flow = 7.96 - .15 * 7.69, fhigh = 7.96 + .15 * 7.96, win = 1, xmax = 10) |> # gaussian window
    # this is ma_scl peak no. 5/6
    astrochron::bandpass(flow = 2.55 - .15 * 2.55, fhigh = 2.55 + .15 * 2.55, win = 1, xmax = 10) |> # gaussian window
    ## astrochron::taner(flow = 0, fhigh = .3, xmax = 1) |> # taner window
    as_tibble()

  filt_hb <- filt_bp_prec |>
    astrochron::hilbert(genplot = TRUE, output = TRUE) |>
    ## astrochron::peak() |>
    as_tibble()
#+end_src

#+RESULTS:
#+begin_example
----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01994842
 ,* Center of bandpass filter = 2.5
 ,* 86 pos/neg frequency pairs will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01994842
 ,* Center of bandpass filter = 4
 ,* 86 pos/neg frequency pairs will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----

----- APPLYING PIECEWISE-LINEAR INTERPOLATION TO STRATIGRAPHIC SERIES -----

 ,* Number of samples= 1840
 ,* Determining median sampling interval for series
 ,* Will interpolate to median sampling interval of 0.025
 ,* New number of samples= 1733
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01994842
 ,* Center of bandpass filter = 6.7
 ,* 86 pos/neg frequency pairs will be bandpassed
Warning message:
In regularize.values(x, y, ties, missing(ties), na.rm = na.rm) :
  collapsing to unique 'x' values
----- PERFORMING HILBERT TRANSFORM ON STRATIGRAPHIC SERIES -----
 ,* Number of data points= 1733
 ,* Sample interval= 0.025
 ,* Mean value removed= -0.01987432
#+end_example

**** clean up colour data
:PROPERTIES:
:CREATED:  [2023-09-22 Fri 13:43]
:END:
#+begin_src R
  col_w <- col |>
    tidylog::filter(
               !is.na(my_rmcd),
               ## my_rmcd > 319.46,
               my_rmcd > 320.35, # the depth of the K/Pg massive shift in MS and colour
               on_splice) |>
    ## mutate(var = `a*`) |>
    ## mutate(var = `b*`) |> # or `L*`
    ## mutate(var = `a*` / `b*`) |> # or `L*`
    mutate(var = `L*`) |> # or `L*`
    mutate(scl_ma = scale(var - slider::slide_mean(var,
                                                   before = 200,
                                                   after = 200)))
#+end_src

#+RESULTS:
: filter: removed 35,321 rows (92%), 3,258 rows remaining

**** bp on scaled
:PROPERTIES:
:CREATED:  [2023-09-25 Mon 16:47]
:END:
#+begin_src R
  filts_scl <- comp |>
      nest(.by = c(name, site)) |>
      # different filters per proxy
      mutate(flow = case_when(name == "MS" ~ 1 / 12,
                              name == "Lstar" ~ 1 / 12,
                              name == "d13C_VPDB" ~ 1 / 12,
                              TRUE ~ NA_real_),
             fhigh = case_when(name == "MS" ~ 1 / 24,
                               name == "Lstar" ~ 1 / 29, # this was 22 in Batenburg 2012, 29 in 2014.
                               name == "d13C_VPDB" ~ 1 / 31,
                               TRUE ~ NA_real_)) |>
      mutate(
        bp = pmap(list(data, flow, fhigh),
                 \(d, l, h) d |>
                   mutate(scl = scale(value)[, 1]) |>
                   select(depth, scl) |>
                   astrochron::linterp(genplot = FALSE, verbose = FALSE) |>
                   astrochron::bandpass(flow = l, fhigh = h, win = 0,
                                        genplot = FALSE))
      ) |>
      unnest(cols = bp) |>
      rename(filt = scl)
#+end_src

#+RESULTS:
#+begin_example

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 386
 ,* Sample interval= 0.375
 ,* Mean value removed= -0.07309613
 ,* Center of bandpass filter = 0.0577957
 ,* 15 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 1349
 ,* Sample interval= 0.10458
 ,* Mean value removed= 0.09609354
 ,* Center of bandpass filter = 0.0625
 ,* 12 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 1344
 ,* Sample interval= 0.105
 ,* Mean value removed= -0.09514475
 ,* Center of bandpass filter = 0.05890805
 ,* 14 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 625
 ,* Sample interval= 0.08
 ,* Mean value removed= 0.0221335
 ,* Center of bandpass filter = 0.0625
 ,* 4 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 625
 ,* Sample interval= 0.08
 ,* Mean value removed= 0.02285176
 ,* Center of bandpass filter = 0.05890805
 ,* 5 pos/neg frequency pairs will be bandpassed
#+end_example

**** bp on the gam with white/red separation
:PROPERTIES:
:CREATED:  [2023-09-25 Mon 16:18]
:END:
#+begin_src R
  filts_fancy <-
    smooth |>
    nest(.by = c(name, site)) |>
    # different filters per site
    ## mutate(flow = case_when(site == "Zumaia" & name == "MS" ~ 1 / 12,
    ##                         site == "Zumaia" & name == "Lstar" ~ 1 / 12,
    ##                         site == "Zumaia" & name == "d13C_VPDB" ~ 1 / 12,
    ##                         # filter intervals from Batenburg 2014 fig 3
    ##                         site == "Sopelana" & name == "MS" ~ 1 / 8.1,
    ##                         site == "Sopelana" & name == "Lstar" ~ 1 / 7.7,
    ##                         site == "Sopelana" & name == "d13C_VPDB" ~ 1 / 8.1,
    ##                         TRUE ~ NA_real_),
    ##        fhigh = case_when(site == "Zumaia" & name == "MS" ~ 1 / 40,
    ##                          site == "Zumaia" & name == "Lstar" ~ 1 / 22,
    ##                          site == "Zumaia" & name == "d13C_VPDB" ~ 1 / 31,
    ##                          site == "Sopelana" & name == "MS" ~ 1 / 15.8,
    ##                          site == "Sopelana" & name == "Lstar" ~ 1 / 14.3,
    ##                          ## site == "Sopelana" & name == "d13C_VPDB" ~ 1 /
    ##                          TRUE ~ NA_real_)) |>
    # different filters per proxy
    mutate(flow = case_when(name == "MS" ~ 1 / 12,
                            name == "Lstar" ~ 1 / 12,
                            name == "d13C_VPDB" ~ 1 / 12,
                            TRUE ~ NA_real_),
           fhigh = case_when(name == "MS" ~ 1 / 24,
                             name == "Lstar" ~ 1 / 29, # this was 22 in Batenburg 2012, 29 in 2014.
                             name == "d13C_VPDB" ~ 1 / 31,
                             TRUE ~ NA_real_)) |>
    mutate(
      bp = pmap(list(data, flow, fhigh),
               \(d, l, h) d |>
                 select(depth, det) |>
                 astrochron::linterp(genplot = FALSE, verbose = FALSE) |>
                 astrochron::bandpass(flow = l, fhigh = h, win = 0,
                                      genplot = FALSE))
    ) |>
    unnest(cols = bp) |>
    rename(filt = det)
  # TODO: 100 kyr
#+end_src

#+RESULTS:
#+begin_example

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 386
 ,* Sample interval= 0.375
 ,* Mean value removed= -0.06151652
 ,* Center of bandpass filter = 0.0577957
 ,* 15 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 1349
 ,* Sample interval= 0.10458
 ,* Mean value removed= 0.02744599
 ,* Center of bandpass filter = 0.0625
 ,* 12 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 1344
 ,* Sample interval= 0.105
 ,* Mean value removed= -0.0158664
 ,* Center of bandpass filter = 0.05890805
 ,* 14 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 625
 ,* Sample interval= 0.08
 ,* Mean value removed= 0.04618908
 ,* Center of bandpass filter = 0.0625
 ,* 4 pos/neg frequency pairs will be bandpassed

----- BANDPASS FILTERING STRATIGRAPHIC SERIES-----
 ,* Number of data points= 625
 ,* Sample interval= 0.08
 ,* Mean value removed= -0.0161482
 ,* Center of bandpass filter = 0.05890805
 ,* 5 pos/neg frequency pairs will be bandpassed
#+end_example

*** load in the identified 405-kyr minima from the field of [cite:@Batenburg2012]
:PROPERTIES:
:CREATED:  [2023-09-25 Mon 11:01]
:END:
#+begin_src R
  agem <- read_csv("dat/Batenburg2012/405_minima.csv")
#+end_src

#+RESULTS:
: indexing 405_minima.csv [===========================================================] 58.04MB/s, eta:  0s                                                                                                                                            Rows: 20 Columns: 5
: ── Column specification ─────────────────────────────────────────────────────────────────────────────────
: Delimiter: ","
: chr (3): comment, minmax, desc
: dbl (2): strat_bot, strat_top
:
: ℹ Use `spec()` to retrieve the full column specification for this data.
: ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

